{
  "group": "admin",
  "name": "admin.conversations.search",
  "deprecated": false,
  "desc": "Search for public or private channels in an Enterprise organization.",
  "args": {
    "connected_team_ids": {
      "required": false,
      "example": "['T00000000','T00000001']",
      "desc": "Array of encoded team IDs, signifying the external orgs to search through.",
      "type": "array"
    },
    "cursor": {
      "required": false,
      "example": "dXNlcjpVMEc5V0ZYTlo=",
      "desc": "Set cursor to next_cursor returned by the previous call to list items in the next page.",
      "type": "string"
    },
    "limit": {
      "required": false,
      "example": "10",
      "desc": "Maximum number of items to be returned. Must be between 1 - 20 both inclusive. Default is 10.",
      "type": "integer"
    },
    "query": {
      "required": false,
      "example": "announcement",
      "desc": "Name of the the channel to query by.",
      "type": "string"
    },
    "search_channel_types": {
      "required": false,
      "example": "private,archived",
      "desc": "The type of channel to include or exclude in the search. For example private will search private channels, while private_exclude will exclude them. For a full list of types, check the Types section.",
      "type": "array"
    },
    "sort": {
      "required": false,
      "example": "member_count",
      "desc": "Possible values are relevant (search ranking based on what we think is closest), name (alphabetical), member_count (number of users in the channel), and created (date channel was created). You can optionally pair this with the sort_dir arg to change how it is sorted.",
      "type": "string"
    },
    "sort_dir": {
      "required": false,
      "example": "desc",
      "desc": "Sort direction. Possible values are asc for ascending order like (1, 2, 3) or (a, b, c), and desc for descending order like (3, 2, 1) or (c, b, a).",
      "type": "string"
    },
    "team_ids": {
      "required": false,
      "example": "T00000000,T00000001",
      "desc": "Comma separated string of team IDs, signifying the internal workspaces to search through.",
      "type": "array"
    },
    "total_count_only": {
      "required": false,
      "example": "",
      "desc": "Only return the total_count of channels. Omits channel data and allows access for admins without channel manager permissions.",
      "type": "boolean"
    }
  },
  "response": {
    "examples": [
      "{\n    \"ok\": true,\n    \"conversations\": [\n        {\n            \"id\": \"GSEV0B5PY\",\n            \"name\": \"privacy-channel\",\n            \"purpose\": \"Group messaging with: @rita @nwhere @meanie\",\n            \"member_count\": -1,\n            \"created\": 1578423973,\n            \"creator_id\": \"WPQ65MVKK\",\n            \"is_private\": true,\n            \"is_archived\": true,\n            \"is_general\": false,\n            \"last_activity_ts\": 1583198954000200,\n            \"is_ext_shared\": false,\n            \"is_global_shared\": true,\n            \"is_org_default\": false,\n            \"is_org_mandatory\": false,\n            \"is_org_shared\": true,\n            \"is_frozen\": false,\n            \"connected_team_ids\": [],\n            \"internal_team_ids_count\": 4,\n            \"internal_team_ids_sample_team\": \"T013F30DBAB\",\n            \"pending_connected_team_ids\": [],\n            \"is_pending_ext_shared\": false\n        },\n        {\n            \"id\": \"C013JDPD6CR\",\n            \"name\": \"proj-decomposed-monolith\",\n            \"purpose\": \"\",\n            \"member_count\": 1,\n            \"created\": 1588786531,\n            \"creator_id\": \"WPQ65MVKK\",\n            \"is_private\": false,\n            \"is_archived\": false,\n            \"is_general\": false,\n            \"last_activity_ts\": 1589854024000200,\n            \"is_ext_shared\": false,\n            \"is_global_shared\": false,\n            \"is_org_default\": false,\n            \"is_org_mandatory\": false,\n            \"is_org_shared\": true,\n            \"is_frozen\": false,\n            \"connected_team_ids\": [],\n            \"internal_team_ids_count\": 1,\n            \"internal_team_ids_sample_team\": \"TPQ67R81F\",\n            \"pending_connected_team_ids\": [],\n            \"is_pending_ext_shared\": false\n        }\n    ],\n    \"next_cursor\": \"aWQ6Mw==\",\n    \"total_count\": 14823\n}"
    ]
  },
  "errors": {
    "connected_team_passed_in_is_not_top_level_team": "One of the orgs provided in the external connected teams filter is not a top level team.",
    "external_team_not_connected_to_this_org": "One of the teams provided in the external connected teams filter is not connected to the org.",
    "feature_not_enabled": "The token provided doesn't have access to this method.",
    "invalid_auth": "Some aspect of authentication cannot be validated. Either the provided token is invalid or the request originates from an IP address disallowed from making the request.",
    "invalid_cursor": "The provided cursor is not valid, often due to not urlencoding query parameters.",
    "invalid_search_channel_type": "An invalid search_channel_types arg was passed. Make sure there are no spaces between your args and that each is one of the enumerated options listed above.",
    "invalid_sort": "The provided sort argument wasn't valid.",
    "invalid_sort_dir": "The provided sort_dir argument wasn't valid.",
    "not_allowed": "The authenticated user does not have the permission to call this method.",
    "not_an_admin": "The token provided is not associated with an Org Admin or Owner.",
    "not_an_enterprise": "This endpoint can only be called by an Enterprise organization.",
    "team_not_found": "One of the workspaces provided in the list wasn't found.",
    "access_denied": "Access to a resource specified in the request is denied.",
    "account_inactive": "Authentication token is for a deleted user or workspace when using a bot token.",
    "deprecated_endpoint": "The endpoint has been deprecated.",
    "ekm_access_denied": "Administrators have suspended the ability to post a message.",
    "enterprise_is_restricted": "The method cannot be called from an Enterprise.",
    "is_bot": "This method cannot be called by a legacy bot.",
    "method_deprecated": "The method has been deprecated.",
    "missing_scope": "The token used is not granted the specific scope permissions required to complete this request.",
    "not_allowed_token_type": "The token type used in this request is not allowed.",
    "not_authed": "No authentication token provided.",
    "no_permission": "The workspace token used in this request does not have the permissions necessary to complete the request. Make sure your app is a member of the conversation it's attempting to post a message to.",
    "org_login_required": "The workspace is undergoing an enterprise migration and will not be available until migration is complete.",
    "token_expired": "Authentication token has expired.",
    "token_revoked": "Authentication token is for a deleted user or workspace or the app has been removed when using a user token.",
    "two_factor_setup_required": "Two factor setup is required.",
    "accesslimited": "Access to this method is limited on the current network.",
    "fatal_error": "The server could not complete your operation(s) without encountering a catastrophic error. It's possible some aspect of the operation succeeded before the error was raised.",
    "internal_error": "The server could not complete your operation(s) without encountering an error, likely due to a transient issue on our end. It's possible some aspect of the operation succeeded before the error was raised.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_arguments": "The method was either called with invalid arguments or some detail about the arguments passed is invalid, which is more likely when using complex arguments like blocks or attachments.",
    "invalid_array_arg": "The method was passed an array as an argument. Please only input valid strings.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8 iso-8859-1.",
    "invalid_form_data": "The method was called via a POST request with Content-Type application/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/json application/x-www-form-urlencoded multipart/form-data text/plain.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "ratelimited": "The request has been ratelimited. Refer to the Retry-After header for when to retry the request.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated.",
    "service_unavailable": "The service is temporarily unavailable.",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete."
  }
}