{
  "group": "chat",
  "name": "chat.update",
  "desc": "Updates a message.",
  "args": {
    "channel": {
      "required": true,
      "example": "C1234567890",
      "desc": "Channel containing the message to be updated.",
      "type": "channel"
    },
    "text": {
      "required": true,
      "example": "Hello world",
      "desc": "New text for the message, using the default formatting rules. It's not required when presenting attachments."
    },
    "ts": {
      "required": true,
      "example": "1405894322.002768",
      "desc": "Timestamp of the message to be updated.",
      "type": "timestamp"
    },
    "as_user": {
      "required": false,
      "example": "true",
      "desc": "Pass true to update the message as the authed user. Bot users in this context are considered authed users."
    },
    "attachments": {
      "required": false,
      "example": "[{\"pretext\": \"pre-hello\", \"text\": \"text-world\"}]",
      "desc": "A JSON-based array of structured attachments, presented as a URL-encoded string. This field is required when not presenting text."
    },
    "link_names": {
      "required": false,
      "example": "true",
      "desc": "Find and link channel names and usernames. Defaults to none. This parameter should be used in conjunction with parse. To set link_names to 1, specify a parse mode of full."
    },
    "parse": {
      "required": false,
      "example": "none",
      "desc": "Change how messages are treated. Defaults to client, unlike chat.postMessage. See below."
    }
  },
  "response": {
    "examples": [

    ]
  },
  "errors": {
    "message_not_found": "No message exists with the requested timestamp.",
    "cant_update_message": "Authenticated user does not have permission to update this message.",
    "channel_not_found": "Value passed for channel was invalid.",
    "edit_window_closed": "The message cannot be edited due to the team message edit settings.",
    "msg_too_long": "Message text is too long.",
    "too_many_attachments": "Too many attachments were provided with this message. A maximum of 100 attachments are allowed on a message.",
    "no_text": "No message text provided.",
    "not_authed": "No authentication token provided.",
    "invalid_auth": "Invalid authentication token.",
    "account_inactive": "Authentication token is for a deleted user or workspace.",
    "no_permission": "The workspace token used in this request does not have the permissions necessary to complete the request.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_array_arg": "The method was passed a PHP-style array argument (e.g. with a name like foo[7]). These are never valid with the Slack API.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8 iso-8859-1.",
    "invalid_form_data": "The method was called via a POST request with Content-Type application/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/x-www-form-urlencoded multipart/form-data text/plain.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated."
  }
}