{
  "group": "usergroups",
  "name": "usergroups.users.update",
  "desc": "This method updates the list of users that belong to a user group. This method replaces all users in a user group with the list of users provided in the users parameter.",
  "args": {
    "usergroup": {
      "required": true,
      "example": "S0604QSJC",
      "desc": "The encoded ID of the user group to update."
    },
    "users": {
      "required": true,
      "example": "U060R4BJ4,U060RNRCZ",
      "desc": "A comma separated string of encoded user IDs that represent the entire list of users for the user group."
    },
    "include_count": {
      "required": false,
      "example": "1",
      "desc": "Include the number of users in the user group."
    }
  },
  "errors": {
    "not_authed": "No authentication token provided.",
    "invalid_auth": "Invalid authentication token.",
    "account_inactive": "Authentication token is for a deleted user or team.",
    "user_is_bot": "This method cannot be called by a bot user.",
    "user_is_restricted": "This method cannot be called by a restricted user or single channel guest.",
    "user_is_ultra_restricted": "This method cannot be called by a single channel guest.",
    "invalid_array_arg": "The method was passed a PHP-style array argument (e.g. with a name like foo[7]). These are never valid with the Slack API.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8 iso-8859-1.",
    "invalid_form_data": "The method was called via a POST request with Content-Type application/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/json application/x-www-form-urlencoded multipart/form-data text/plain.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated."
  }
}