{
  "group": "assistant",
  "name": "assistant.search.context",
  "deprecated": false,
  "desc": "Searches messages across your Slack organization—perfect for broad, specific, and real-time data retrieval.",
  "args": {
    "query": {
      "required": true,
      "example": "What is project gizmo?",
      "desc": "User prompt or search query.",
      "type": "string"
    },
    "action_token": {
      "required": false,
      "example": "12345.98765.abcd2358fdea",
      "desc": "Send action_token as received in a message event.",
      "type": "string"
    },
    "after": {
      "required": false,
      "example": "1754670081",
      "desc": "UNIX timestamp filter. If present, filters for results after this date.",
      "type": "integer"
    },
    "before": {
      "required": false,
      "example": "1754670081",
      "desc": "UNIX timestamp filter. If present, filters for results before this date.",
      "type": "integer"
    },
    "channel_types": {
      "required": false,
      "example": "public_channel",
      "desc": "Mix and match channel types by providing a comma-separated list of any combination of public_channel, private_channel, mpim, im.",
      "type": "array"
    },
    "content_types": {
      "required": false,
      "example": "messages",
      "desc": "Content types to include, a comma-separated list of any combination of messages, files.",
      "type": "array"
    },
    "context_channel_id": {
      "required": false,
      "example": "C1234567890",
      "desc": "Context channel ID to support scoping the search when applicable."
    },
    "cursor": {
      "required": false,
      "example": "asf91j9jfd",
      "desc": "The cursor returned by the API. Leave this blank for the first request, and use this to get the next page of results.",
      "type": "string"
    },
    "highlight": {
      "required": false,
      "example": "",
      "desc": "Whether to highlight the search query in the results. Defaults to false if unspecified.",
      "type": "boolean"
    },
    "include_bots": {
      "required": false,
      "example": "true",
      "desc": "If you want the results to include bots.",
      "type": "boolean"
    },
    "include_context_messages": {
      "required": false,
      "example": "",
      "desc": "Whether to include context messages surrounding the main message result. Defaults to false if unspecified.",
      "type": "boolean"
    },
    "include_message_blocks": {
      "required": false,
      "example": "",
      "desc": "Whether to return the message blocks in the response.",
      "type": "boolean"
    },
    "limit": {
      "required": false,
      "example": "20",
      "desc": "Number of results to return, up to a max of 20. Defaults to 20.",
      "type": "integer"
    },
    "sort": {
      "required": false,
      "example": "score",
      "desc": "The field to sort the results by. Defaults to score. Can be one of: score, timestamp.",
      "type": "enum"
    },
    "sort_dir": {
      "required": false,
      "example": "desc",
      "desc": "The direction to sort the results by. Defaults to desc.",
      "type": "enum"
    }
  },
  "response": {
    "examples": [
      "{\n    \"ok\": true,\n    \"results\": {\n        \"messages\": [\n            {\n                \"author_user_id\": \"U0123456\",\n                \"team_id\": \"T0123456\",\n                \"channel_id\": \"C0123456\",\n                \"message_ts\": \"123456.7890\",\n                \"content\": \"Hey team, we'll be kicking off our mobile UX revamp for the Gizmo App...\",\n                \"is_author_bot\": false,\n                \"permalink\": \"https://mycompany.slack.com/archives/C012345ABC/p123456789\"\n            }\n        ]\n    },\n    \"response_metadata\": {\n        \"next_cursor\": \"Q1VSUkVOVF9QQUdFOjI=\"\n    }\n}",
      "{\n    \"ok\": false,\n    \"error\": \"invalid_auth\"\n}"
    ]
  },
  "errors": {
    "internal_error": "The server could not complete your operation(s) without encountering an error, likely due to a transient issue on our end. It's possible some aspect of the operation succeeded before the error was raised.",
    "rate_limited": "rate limited.",
    "missing_query": "missing query.",
    "query_too_long": "query too long.",
    "feature_not_enabled": "The feature is not available on the current workspace.",
    "invalid_action_token": "action_token provided is not valid.",
    "invalid_cursor": "cursormark provided is not valid.",
    "context_channel_not_found": "Specified context_channel_id is invalid, or the user lacks permission to view it.",
    "access_denied": "Access to a resource specified in the request is denied.",
    "account_inactive": "Authentication token is for a deleted user or workspace when using a bot token.",
    "deprecated_endpoint": "The endpoint has been deprecated.",
    "ekm_access_denied": "Administrators have suspended the ability to post a message.",
    "enterprise_is_restricted": "The method cannot be called from an Enterprise.",
    "invalid_auth": "Some aspect of authentication cannot be validated. Either the provided token is invalid or the request originates from an IP address disallowed from making the request.",
    "is_bot": "This method cannot be called by a legacy bot.",
    "method_deprecated": "The method has been deprecated.",
    "missing_scope": "The token used is not granted the specific scope permissions required to complete this request.",
    "not_allowed_token_type": "The token type used in this request is not allowed.",
    "not_authed": "No authentication token provided.",
    "no_permission": "The workspace token used in this request does not have the permissions necessary to complete the request. Make sure your app is a member of the conversation it's attempting to post a message to.",
    "org_login_required": "The workspace is undergoing an enterprise migration and will not be available until migration is complete.",
    "token_expired": "Authentication token has expired.",
    "token_revoked": "Authentication token is for a deleted user or workspace or the app has been removed when using a user token.",
    "two_factor_setup_required": "Two factor setup is required.",
    "team_access_not_granted": "The token used is not granted the specific workspace access required to complete this request.",
    "accesslimited": "Access to this method is limited on the current network.",
    "fatal_error": "The server could not complete your operation(s) without encountering a catastrophic error. It's possible some aspect of the operation succeeded before the error was raised.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_arguments": "The method was either called with invalid arguments or some detail about the arguments passed is invalid, which is more likely when using complex arguments like blocks or attachments.",
    "invalid_array_arg": "The method was passed an array as an argument. Please only input valid strings.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8 iso-8859-1.",
    "invalid_form_data": "The method was called via a POST request with Content-Type application/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/json application/x-www-form-urlencoded multipart/form-data text/plain.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "ratelimited": "The request has been ratelimited. Refer to the Retry-After header for when to retry the request.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated.",
    "service_unavailable": "The service is temporarily unavailable.",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete."
  }
}