{
  "group": "users",
  "name": "users.admin.invite",
  "desc": "Send an invitation to a new user by email",
  "args": {
    "email": {
      "required": true,
      "example": "john.doe@email.com",
      "desc": "Email address of the new user"
    },
    "channels": {
      "required": false,
      "example": "C1234567890,G12345678",
      "desc": "Comma-separated list of IDs (not names!) for channels, which the new user will auto-join. Both channel IDs for public channels and group IDs for private chanels work."
    },
    "first_name": {
      "required": false,
      "example": "John",
      "desc": "Prefilled input for the \"First name\" field on the \"new user registration\" page."
    },
    "last_name": {
      "required": false,
      "example": "Doe",
      "desc": "Prefilled input for the \"Last name\" field on the \"new user registration\" page."
    },
    "resend": {
      "required": false,
      "example": "true",
      "desc": "Resend the invitation email if the user has already been invited and the email was sent some time ago."
    },
    "restricted": {
      "required": false,
      "example": "true",
      "desc": "Invite a guest that can use multiple channels"
    },
    "ultra_restricted": {
      "required": false,
      "example": "true",
      "desc": "Invite a guest that can use one channel only"
    }
  },
  "response": {
    "examples": [
      "{\n    \"ok\": true\n}"
    ]
  },
  "errors": {
    "already_invited": "User has already received an email invitation",
    "already_in_team": "User is already part of the team",
    "channel_not_found": "Value passed for channel was invalid.",
    "sent_recently": "When using resend=true, the email has been sent recently already",
    "user_disabled": "User account has been deactivated",
    "missing_scope": "The calling token is not granted the necessary scopes to complete this operation.",
    "invalid_email": "Invalid email address (e.g. \"qwe\"). Note that Slack does not recognize some email addresses even though they are technically valid. This is a known issue.",
    "not_allowed": "When SSO is enabeld this method can not be used to invite new users except guests. The SCIM API needs to be used instead to invite new users. For inviting guests the restricted or ultra_restricted property needs to be provided"
  }
}
