{
  "group": "tooling",
  "name": "tooling.tokens.rotate",
  "deprecated": false,
  "desc": "Exchanges a refresh token for a new app configuration token.",
  "args": {
    "refresh_token": {
      "required": true,
      "desc": "The xoxe refresh token that was issued along with the old app configuration token.",
      "type": "string"
    }
  },
  "response": {
    "examples": [
      "{\n    \"ok\": true,\n    \"token\": \"xoxe.xoxp-...\",\n    \"refresh_token\": \"xoxe-...\",\n    \"team_id\": \"...\",\n    \"user_id\": \"...\",\n    \"iat\": 1633095660,\n    \"exp\": 1633138860\n}",
      "{\n    \"ok\": false,\n    \"error\": \"invalid_refresh_token\"\n}"
    ]
  },
  "errors": {
    "internal_error": "The server could not complete your operation(s) without encountering an error, likely due to a transient issue on our end. It's possible some aspect of the operation succeeded before the error was raised.",
    "invalid_refresh_token": "The given refresh token is invalid.",
    "unknown_error": "Temporary error for dev only restriction.",
    "accesslimited": "Access to this method is limited on the current network.",
    "fatal_error": "The server could not complete your operation(s) without encountering a catastrophic error. It's possible some aspect of the operation succeeded before the error was raised.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_arguments": "The method was either called with invalid arguments or some detail about the arguments passed is invalid, which is more likely when using complex arguments like blocks or attachments.",
    "invalid_array_arg": "The method was passed an array as an argument. Please only input valid strings.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8 iso-8859-1.",
    "invalid_form_data": "The method was called via a POST request with Content-Type application/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/json application/x-www-form-urlencoded multipart/form-data text/plain.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "ratelimited": "The request has been ratelimited. Refer to the Retry-After header for when to retry the request.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated.",
    "service_unavailable": "The service is temporarily unavailable.",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete."
  }
}