{
  "group": "channels",
  "name": "channels.list",
  "desc": "Lists all channels in a Slack team.",
  "args": {
    "cursor": {
      "required": false,
      "example": "dXNlcjpVMDYxTkZUVDI=",
      "desc": "Paginate through collections of data by setting the cursor parameter to a next_cursor attribute returned by a previous request's response_metadata. Default value fetches the first \"page\" of the collection. See pagination for more detail."
    },
    "exclude_archived": {
      "required": false,
      "example": "true",
      "desc": "Exclude archived channels from the list."
    },
    "exclude_members": {
      "required": false,
      "example": "true",
      "desc": "Exclude the members collection from each channel."
    },
    "limit": {
      "required": false,
      "example": "20",
      "desc": "The maximum number of items to return. Fewer than the requested number of items may be returned, even if the end of the users list hasn't been reached."
    }
  },
  "response": {
    "examples": [
      "{\n    \"ok\": true,\n    \"channels\": [\n        {\n            \"id\": \"C0G9QF9GW\",\n            \"name\": \"random\",\n            \"is_channel\": true,\n            \"created\": 1449709280,\n            \"creator\": \"U0G9QF9C6\",\n            \"is_archived\": false,\n            \"is_general\": false,\n            \"name_normalized\": \"random\",\n            \"is_shared\": false,\n            \"is_org_shared\": false,\n            \"is_member\": true,\n            \"is_private\": false,\n            \"is_mpim\": false,\n            \"members\": [\n                \"U0G9QF9C6\",\n                \"U0G9WFXNZ\"\n            ],\n            \"topic\": {\n                \"value\": \"Other stuff\",\n                \"creator\": \"U0G9QF9C6\",\n                \"last_set\": 1449709352\n            },\n            \"purpose\": {\n                \"value\": \"A place for non-work-related flimflam, faffing, hodge-podge or jibber-jabber you'd prefer to keep out of more focused work-related channels.\",\n                \"creator\": \"\",\n                \"last_set\": 0\n            },\n            \"previous_names\": [],\n            \"num_members\": 2\n        },\n        {\n            \"id\": \"C0G9QKBBL\",\n            \"name\": \"general\",\n            \"is_channel\": true,\n            \"created\": 1449709280,\n            \"creator\": \"U0G9QF9C6\",\n            \"is_archived\": false,\n            \"is_general\": true,\n            \"name_normalized\": \"general\",\n            \"is_shared\": false,\n            \"is_org_shared\": false,\n            \"is_member\": true,\n            \"is_private\": false,\n            \"is_mpim\": false,\n            \"members\": [\n                \"U0G9QF9C6\",\n                \"U0G9WFXNZ\"\n            ],\n            \"topic\": {\n                \"value\": \"Talk about anything!\",\n                \"creator\": \"U0G9QF9C6\",\n                \"last_set\": 1449709364\n            },\n            \"purpose\": {\n                \"value\": \"To talk about anything!\",\n                \"creator\": \"U0G9QF9C6\",\n                \"last_set\": 1449709334\n            },\n            \"previous_names\": [],\n            \"num_members\": 2\n        }\n    ],\n    \"response_metadata\": {\n        \"next_cursor\": \"dGVhbTpDMUg5UkVTR0w=\"\n    }\n}",
      "{\n    \"ok\": false,\n    \"error\": \"invalid_auth\"\n}"
    ]
  },
  "errors": {
    "invalid_cursor": "Value passed for cursor was not valid or is no longer valid.",
    "limit_required": "For large teams a limit is required.",
    "not_authed": "No authentication token provided.",
    "invalid_auth": "Some aspect of authentication cannot be validated. Either the provided token is invalid or the request originates from an IP address disallowed from making the request.",
    "account_inactive": "Authentication token is for a deleted user or workspace.",
    "token_revoked": "Authentication token is for a deleted user or workspace or the app has been removed.",
    "no_permission": "The workspace token used in this request does not have the permissions necessary to complete the request. Make sure your app is a member of the conversation it's attempting to post a message to.",
    "org_login_required": "The workspace is undergoing an enterprise migration and will not be available until migration is complete.",
    "ekm_access_denied": "Administrators have suspended the ability to post a message.",
    "missing_scope": "The token used is not granted the specific scope permissions required to complete this request.",
    "not_allowed_token_type": "The token type used in this request is not allowed.",
    "invalid_arguments": "The method was called with invalid arguments.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8 iso-8859-1.",
    "invalid_form_data": "The method was called via a POST request with Content-Type application/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/json application/x-www-form-urlencoded multipart/form-data text/plain.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated.",
    "service_unavailable": "The service is temporarily unavailable.",
    "fatal_error": "The server could not complete your operation(s) without encountering a catastrophic error. It's possible some aspect of the operation succeeded before the error was raised.",
    "internal_error": "The server could not complete your operation(s) without encountering an error, likely due to a transient issue on our end. It's possible some aspect of the operation succeeded before the error was raised.",
    "method_deprecated": "The method called is retired and no longer accepts requests. Examine the error closely for suggestions on alternative methods to use or browse api.slack.com/changelog for more information."
  },
  "deprecated": true,
  "deprecation": {
    "deprecation_warning": "This method is deprecated. It will stop functioning in February 2021 and will not work with newly created apps after June 10th, 2020.",
    "alternative_methods": [
      "conversations.list",
      "users.conversations"
    ]
  }
}