{
  "group": "groups",
  "name": "groups.kick",
  "desc": "This method allows a user to remove another member from a private channel.",
  "args": {
    "channel": {
      "required": true,
      "example": "G1234567890",
      "desc": "Private channel to remove user from.",
      "type": "group"
    },
    "user": {
      "required": true,
      "example": "U1234567890",
      "desc": "User to remove from private channel.",
      "type": "user"
    }
  },
  "errors": {
    "channel_not_found": "Value passed for channel was invalid.",
    "user_not_found": "Value passed for user was invalid.",
    "cant_kick_self": "You can't remove yourself from a group.",
    "not_in_group": "User or caller were are not in the group.",
    "restricted_action": "A team preference prevents the authenticated user from kicking.",
    "not_authed": "No authentication token provided.",
    "invalid_auth": "Invalid authentication token.",
    "account_inactive": "Authentication token is for a deleted user or team.",
    "user_is_bot": "This method cannot be called by a bot user.",
    "user_is_restricted": "This method cannot be called by a restricted user or single channel guest.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of common decency. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_array_arg": "The method was passed a PHP-style array argument (e.g. with a name like foo[7]). These are never valid with the Slack API.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8 iso-8859-1.",
    "invalid_form_data": "The method was called via a POST request with Content-Type application/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/x-www-form-urlencoded multipart/form-data text/plain.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated."
  }
}