{
  "group": "groups",
  "name": "groups.info",
  "desc": "Gets information about a private channel.",
  "args": {
    "channel": {
      "required": true,
      "example": "G1234567890",
      "desc": "Private channel to get info on.",
      "type": "group"
    },
    "include_locale": {
      "required": false,
      "example": "true",
      "desc": "Set this to true to receive the locale for this group. Defaults to false."
    }
  },
  "response": {
    "examples": [
      "{\n    \"ok\": true,\n    \"group\": {\n        \"id\": \"G024BE91L\",\n        \"name\": \"secretplans\",\n        \"is_group\": \"true\",\n        \"created\": 1360782804,\n        \"creator\": \"U024BE7LH\",\n        \"is_archived\": false,\n        \"members\": [\n            \"U024BE7LH\"\n        ],\n\n        \"topic\": { … },\n        \"purpose\": { … },\n\n        \"last_read\": \"1401383885.000061\",\n        \"latest\": { … }\n        \"unread_count\": 0,\n        \"unread_count_display\": 0\n\n    },\n}"
    ]
  },
  "errors": {
    "channel_not_found": "Value passed for channel was invalid.",
    "not_authed": "No authentication token provided.",
    "invalid_auth": "Invalid authentication token.",
    "account_inactive": "Authentication token is for a deleted user or workspace.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_array_arg": "The method was passed a PHP-style array argument (e.g. with a name like foo[7]). These are never valid with the Slack API.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8 iso-8859-1.",
    "invalid_form_data": "The method was called via a POST request with Content-Type application/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/x-www-form-urlencoded multipart/form-data text/plain.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated."
  }
}