{
  "group": "conversations",
  "name": "conversations.invite",
  "deprecated": false,
  "desc": "Invites users to a channel.",
  "args": {
    "channel": {
      "required": true,
      "example": "C1234567890",
      "desc": "The ID of the public or private channel to invite user(s) to.",
      "type": "channel"
    },
    "users": {
      "required": true,
      "example": "W1234567890,U2345678901,U3456789012",
      "desc": "A comma separated list of user IDs. Up to 1000 users may be listed.",
      "type": "string"
    },
    "force": {
      "required": false,
      "example": "false",
      "desc": "When set to true and multiple user IDs are provided, continue inviting the valid ones while disregarding invalid IDs. Defaults to false.",
      "type": "boolean"
    }
  },
  "response": {
    "examples": [
      "{\n    \"ok\": true,\n    \"channel\": {\n        \"id\": \"C012AB3CD\",\n        \"name\": \"general\",\n        \"is_channel\": true,\n        \"is_group\": false,\n        \"is_im\": false,\n        \"created\": 1449252889,\n        \"creator\": \"W012A3BCD\",\n        \"is_archived\": false,\n        \"is_general\": true,\n        \"unlinked\": 0,\n        \"name_normalized\": \"general\",\n        \"is_read_only\": false,\n        \"is_shared\": false,\n        \"is_ext_shared\": false,\n        \"is_org_shared\": false,\n        \"pending_shared\": [],\n        \"is_pending_ext_shared\": false,\n        \"is_member\": true,\n        \"is_private\": false,\n        \"is_mpim\": false,\n        \"last_read\": \"1502126650.228446\",\n        \"topic\": {\n            \"value\": \"For public discussion of generalities\",\n            \"creator\": \"W012A3BCD\",\n            \"last_set\": 1449709364\n        },\n        \"purpose\": {\n            \"value\": \"This part of the workspace is for fun. Make fun here.\",\n            \"creator\": \"W012A3BCD\",\n            \"last_set\": 1449709364\n        },\n        \"previous_names\": [\n            \"specifics\",\n            \"abstractions\",\n            \"etc\"\n        ]\n    }\n}",
      "{\n    \"ok\": false,\n    \"error\": \"user_not_found\",\n    \"errors\": [\n        {\n            \"user\": \"U111111\",\n            \"ok\": false,\n            \"error\": \"user_not_found\"\n        },\n        {\n            \"user\": \"U222222\",\n            \"ok\": false,\n            \"error\": \"cant_invite_self\"\n        }\n    ]\n}"
    ]
  },
  "errors": {
    "already_in_channel": "Invited user is already in the channel.",
    "cant_invite": "User cannot be invited to this channel.",
    "cant_invite_self": "Authenticated user cannot invite themselves to a channel.",
    "channel_not_found": "Value passed for channel was invalid.",
    "invitee_cant_see_channel": "The Grid multi-workspace channel you are inviting a user to is not shared with any workspaces the user is currently a member of.",
    "is_archived": "Channel has been archived.",
    "org_user_not_in_team": "One or more members invited are part of the Enterprise Grid organization but not the specific workspace you're interfacing with.",
    "method_not_supported_for_channel_type": "This type of conversation cannot be used with this method.",
    "missing_scope": "The token used is not granted the specific scope permissions required to complete this request.",
    "no_permission": "The workspace token used in this request does not have the permissions necessary to complete the request. Make sure your app is a member of the conversation it's attempting to post a message to.",
    "no_external_invite_permission": "User does not have permission to invite that external user to the channel.",
    "no_user": "No value was passed for users.",
    "not_in_channel": "Authenticated user is not in the channel.",
    "ura_max_channels": "An invited user is a single-channel guest user ('ultra restricted access') that is already in the maximum number of conversations.",
    "user_is_restricted": "An invited user is a guest user that is restricted from accessing this conversation.",
    "user_not_found": "Value passed for users was invalid.",
    "access_denied": "Access to a resource specified in the request is denied.",
    "account_inactive": "Authentication token is for a deleted user or workspace when using a bot token.",
    "deprecated_endpoint": "The endpoint has been deprecated.",
    "ekm_access_denied": "Administrators have suspended the ability to post a message.",
    "enterprise_is_restricted": "The method cannot be called from an Enterprise.",
    "invalid_auth": "Some aspect of authentication cannot be validated. Either the provided token is invalid or the request originates from an IP address disallowed from making the request.",
    "is_bot": "This method cannot be called by a legacy bot.",
    "user_is_ultra_restricted": "This method cannot be called by a single channel guest.",
    "method_deprecated": "The method has been deprecated.",
    "not_allowed_token_type": "The token type used in this request is not allowed.",
    "not_authed": "No authentication token provided.",
    "org_login_required": "The workspace is undergoing an enterprise migration and will not be available until migration is complete.",
    "token_expired": "Authentication token has expired.",
    "token_revoked": "Authentication token is for a deleted user or workspace or the app has been removed when using a user token.",
    "two_factor_setup_required": "Two factor setup is required.",
    "team_access_not_granted": "The token used is not granted the specific workspace access required to complete this request.",
    "accesslimited": "Access to this method is limited on the current network.",
    "fatal_error": "The server could not complete your operation(s) without encountering a catastrophic error. It's possible some aspect of the operation succeeded before the error was raised.",
    "internal_error": "The server could not complete your operation(s) without encountering an error, likely due to a transient issue on our end. It's possible some aspect of the operation succeeded before the error was raised.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_arguments": "The method was either called with invalid arguments or some detail about the arguments passed is invalid, which is more likely when using complex arguments like blocks or attachments.",
    "invalid_array_arg": "The method was passed an array as an argument. Please only input valid strings.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8 iso-8859-1.",
    "invalid_form_data": "The method was called via a POST request with Content-Type application/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/json application/x-www-form-urlencoded multipart/form-data text/plain.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "ratelimited": "The request has been ratelimited. Refer to the Retry-After header for when to retry the request.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated.",
    "service_unavailable": "The service is temporarily unavailable.",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete."
  }
}