{
  "group": "conversations",
  "name": "conversations.inviteShared",
  "deprecated": false,
  "desc": "Sends an invitation to a Slack Connect channel",
  "args": {
    "channel": {
      "required": true,
      "desc": "ID of the channel on your team that you'd like to share.",
      "type": "channel"
    },
    "emails": {
      "required": false,
      "desc": "Optional email to receive this invite. Either emails or user_ids must be provided. Only one email or one user ID may be invited at a time.",
      "type": "array"
    },
    "user_ids": {
      "required": false,
      "desc": "Optional user_id to receive this invite. Either emails or user_ids must be provided. Only one email or one user ID may be invited at a time.",
      "type": "array"
    },
    "external_limited": {
      "required": false,
      "desc": "Optional boolean on whether invite is to an external limited member. Defaults to true.",
      "type": "boolean"
    }
  },
  "response": {
    "examples": [
      "{\n    \"ok\": true,\n    \"invite_id\": \"I02UKAJ6RJA\",\n    \"is_legacy_shared_channel\": false\n}",
      "{\n    \"ok\": false,\n    \"error\": \"restricted_action\"\n}"
    ]
  },
  "errors": {
    "access_denied": "Access to a resource specified in the request is denied.",
    "accesslimited": "Access to this method is limited on the current network.",
    "account_inactive": "Authentication token is for a deleted user or workspace when using a bot token.",
    "already_in_channel": "User is already in the channel.",
    "cannot_share_cross_workspace_channel": "You cannot share a cross-workspace or org-wide channel.",
    "cannot_share_mandatory_channel": "You cannot share #general or mandatory channels.",
    "channel_archived": "You cannot share an archived channel.",
    "channel_not_found": "The channel provided was not found.",
    "connection_limit_exceeded": "This channel has hit the limit of external connections.",
    "connection_limit_exceeded_pending": "This channel already has a pending invite.",
    "deprecated_endpoint": "The endpoint has been deprecated.",
    "ekm_access_denied": "Administrators have suspended the ability to post a message.",
    "enterprise_is_restricted": "The method cannot be called from an Enterprise.",
    "fatal_error": "The server could not complete your operation(s) without encountering a catastrophic error. It's possible some aspect of the operation succeeded before the error was raised.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_array_arg": "The method was passed an array as an argument. Please only input valid strings.",
    "invalid_channel_type": "You cannot share MPDMs or DMs.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8 iso-8859-1.",
    "invalid_email": "At least one email address provided is invalid.",
    "invalid_form_data": "The method was called via a POST request with Content-Type application/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/json application/x-www-form-urlencoded multipart/form-data text/plain.",
    "invite_lookup_error": "An error occurred while attempting to look for existing invites.",
    "invite_not_found": "An error occurred while inviting users.",
    "is_bot": "This method cannot be called by a legacy bot.",
    "legacy_connection_limit_exceeded": "You cannot share a legacy ESC channel with a third team",
    "member_limit_exceeded": "This channel that has hit the limit of members",
    "message_too_long": "The provided message was longer than 560 characters.",
    "method_deprecated": "The method has been deprecated.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "missing_scope": "The token used is not granted the specific scope permissions required to complete this request.",
    "no_external_invite_permission": "User does not have permission to invite an external user.",
    "no_permission": "The workspace token used in this request does not have the permissions necessary to complete the request. Make sure your app is a member of the conversation it's attempting to post a message to.",
    "not_allowed_for_grid_workspace": "This workspace does not have Slack Connect enabled.",
    "not_allowed_token_type": "The token type used in this request is not allowed.",
    "not_authed": "No authentication token provided.",
    "not_in_channel": "The app is not a member of the channel to invite.",
    "not_owner": "Only the host organization for a channel can request to share it.",
    "not_paid": "This feature is only available to paid teams.",
    "not_supported": "This channel cannot be shared.",
    "org_login_required": "The workspace is undergoing an enterprise migration and will not be available until migration is complete.",
    "ratelimit": "The rate-limit for this method has been reached. The ratelimit is applied on a per-user basis when you pass the `emails` parameter.",
    "ratelimited": "The request has been ratelimited. Refer to the Retry-After header for when to retry the request.",
    "recipients_not_specified": "Bots are required to specify which users to invite.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated.",
    "restricted_action": "A team preference does not allow this authorization to send invites.",
    "service_unavailable": "The service is temporarily unavailable.",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete.",
    "token_expired": "Authentication token has expired.",
    "token_revoked": "Authentication token is for a deleted user or workspace or the app has been removed when using a user token.",
    "too_many_emails": "Too many email recipients were passed in the `emails` parameter.",
    "two_factor_setup_required": "Two factor setup is required.",
    "unknown_method": "This method is currently not available.",
    "url_in_message": "The message contained a URL.",
    "user_not_found": "User lookup failed."
  }
}