{
  "group": "users",
  "name": "users.profile.set",
  "desc": "This method is used to set the profile information for a user.",
  "args": {
    "user": {
      "required": false,
      "example": "U1234567890",
      "desc": "ID of user to change. This argument may only be specified by team admins on paid teams.",
      "type": "user"
    },
    "profile": {
      "required": false,
      "example": "{ first_name: \"John\", ... }",
      "desc": "Collection of key:value pairs presented as a URL-encoded JSON hash."
    },
    "name": {
      "required": false,
      "example": "first_name",
      "desc": "Name of a single key to set. Usable only if profile is not passed."
    },
    "value": {
      "required": false,
      "example": "John",
      "desc": "Value to set a single key to. Usable only if profile is not passed."
    }
  },
  "errors": {
    "reserved_name": "First or last name are reserved.",
    "invalid_profile": "Profile object passed in is not valid JSON (make sure it is URL encoded!).",
    "profile_set_failed": "Failed to set user profile.",
    "not_admin": "Only admins can update the profile of another user.",
    "not_app_admin": "Only team owners and selected members can update the profile of a bot user.",
    "cannot_update_admin_user": "Only a primary owner can update the profile of an admin.",
    "not_authed": "No authentication token provided.",
    "invalid_auth": "Invalid authentication token.",
    "account_inactive": "Authentication token is for a deleted user or team.",
    "user_is_bot": "This method cannot be called by a bot user.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of common decency. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_array_arg": "The method was passed a PHP-style array argument (e.g. with a name like foo[7]). These are never valid with the Slack API.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8 iso-8859-1.",
    "invalid_form_data": "The method was called via a POST request with Content-Type application/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/x-www-form-urlencoded multipart/form-data text/plain.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated."
  }
}